RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
//#include <Arduino.h>
#include <algorithm>

#include "esp_camera.h"
//#include "EEPROM.h"
#include <hal/i2c_types.h>
#include "esp_log.h"
#include "nvs_flash.h"
#include "esp_event.h"
#include "esp_wifi.h"
//#include <driver/adc.h>
//#include "esp_adc_cal.h"
#include "esp_wifi_types.h"
#include "driver/sdmmc_host.h"
#include "driver/sdmmc_defs.h"
#include "sdmmc_cmd.h"
#include "esp_vfs_fat.h"
//#include "esp_wifi_internal.h"
#include "esp_heap_caps.h"
#include "esp_task_wdt.h"
#include "esp_private/wifi.h"
#include "esp_task_wdt.h"
#include "esp_timer.h"
#include "esp_mac.h"
//#include "bt.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "driver/uart.h"
#include <unistd.h>
#include <fcntl.h>
#include "esp_random.h"

#include "fec_codec.h"
#include "packets.h"
#include "safe_printf.h"
#include "structures.h"
#include "crc.h"
#include "driver/gpio.h"
#include "main.h"
#include "queue.h"
#include "circular_buffer.h"

#ifdef USB_DISK_SUPPORT
#define CFG_TUSB_MCU OPT_MCU_ESP32S3
#include "tinyusb.h"
#include "tusb_msc_storage.h"
#endif

#include "ll_cam.h" // cam_obj_t defination, used in camera_data_available

#include "wifi.h"
#include "nvs_args.h"

#include "osd.h"
#include "msp.h"
#include "avi.h"

#include "vcd_profiler.h"

#include "jpeg_parser.h"
#include "util.h"

#include "hx_mavlink_parser.h"

#include "temperature_sensor.h"

#include "mock_camera.h"

#ifdef SUPPRESS_LOGGING
#define printf(...) do {} while (false)
#define heap_caps_print_heap_info(...) do {} while (false)
#define sdmmc_card_print_info(...) do {} while (false)
#endif

static int s_stats_last_tp = -10000;
static int s_last_osd_packet_tp = -10000;
static int s_last_config_packet_tp = -10000;

#define MJPEG_PATTERN_SIZE 512 

/////////////////////////////////////////////////////////////////////////

static size_t s_video_frame_data_size = 0;
static uint32_t s_video_frame_index = 0;
static uint8_t s_video_part_index = 0;
static bool s_video_frame_started = false;
static size_t s_video_full_frame_size = 0;
static uint8_t s_osdUpdateCounter = 0;
static bool s_lastByte_ff = false;

static int s_actual_capture_fps = 0;
static int s_actual_capture_fps_expected = 0;

static int s_quality = 20;
static float s_quality_framesize_K1 = 0; //startup from minimum quality to decrease pressure
static float s_quality_framesize_K2 = 1;
static float s_quality_framesize_K3 = 1;
static int s_max_frame_size = 0;
static int s_sharpness = 20;

static int64_t s_video_last_sent_tp = esp_timer_get_time();
static int64_t s_video_target_frame_dt = 0;
static uint8_t s_max_wlan_outgoing_queue_usage = 0;
static uint8_t s_min_wlan_outgoing_queue_usage_seen = 0;

static int64_t s_last_seen_config_packet = esp_timer_get_time();;

static int64_t s_restart_time = 0;
static int64_t s_wifi_ovf_time = 0;

extern WIFI_Rate s_wlan_rate;

bool SDError = false;
uint16_t SDTotalSpaceGB16 = 0;
uint16_t SDFreeSpaceGB16 = 0;
uint32_t s_mavlink_baudrate = DEFAULT_MAVLINK_BAUDRATE;
static uint8_t cam_ovf_count = 0;
static float s_camera_temperature = 0;

//=============================================================================================
//=============================================================================================
// Returns a supported MAVLink UART baudrate, falling back to the default for invalid input.
uint32_t getValidMavlinkBaudrate(uint32_t baudrate)
{
    switch (baudrate)
    {
        case 9600:
        case 19200:
        case 38400:
        case 57600:
        case 115200:
            return baudrate;
        default:
            return DEFAULT_MAVLINK_BAUDRATE;
    }
}

int32_t s_dbg;
uint16_t s_framesCounter = 0;

static bool s_initialized = false;
static uint16_t s_camera_sensor_pid = OV2640_PID;

static uint32_t s_last_rc_packet_tp = 0;

#if defined(DVR_SUPPORT) && defined(BOARD_ESP32C5)
static uint8_t s_sd_record_frame_selector = 0;
static bool s_sd_record_current_frame = false;
#endif

static uint16_t s_air_device_id;
static uint16_t s_connected_gs_device_id = 0;

static int64_t s_accept_connection_timeout_ms = 0;

#ifdef UART_MAVLINK

static uint8_t s_mavlink_out_buffer[MAX_TELEMETRY_PAYLOAD_SIZE];
static int s_mavlinkOutBufferCount = 0;
#endif
/////////////////////////////////////////////////////////////////////////

#ifdef SUPPRESS_LOGGING
int s_uart_verbose = 0;
#else
int s_uart_verbose = 1;
#endif

/////////////////////////////////////////////////////////////////////////

sdmmc_card_t* card = nullptr;

volatile bool s_air_record = false;

static bool s_camera_stopped = false;
static bool s_camera_stopped_requested = false;

volatile uint64_t s_shouldRestartRecording = 0;

HXMavlinkParser mavlinkParserIn(true);

//===================================================================================
//===================================================================================
// Returns whether runtime camera detection identified an OV5640 sensor.
// OV3660 is intentionally treated as OV5640 here: it is reported to the GS as OV5640
// (the packet format has no OV3660 id yet).
static bool camera_is_ov5640()
{
    return (s_camera_sensor_pid == OV5640_PID) || (s_camera_sensor_pid == OV3660_PID);
}

//=============================================================================================
//=============================================================================================
void initialize_status_led()
{
#ifdef STATUS_LED_PIN
{
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << STATUS_LED_PIN,
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE };
    gpio_config(&io_conf);
    gpio_set_level(STATUS_LED_PIN, STATUS_LED_OFF);
}
#endif

#ifdef STATUS_LED2_PIN
{
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << STATUS_LED2_PIN,
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE };
    gpio_config(&io_conf);
    gpio_set_level(STATUS_LED2_PIN, STATUS_LED2_OFF);
}
#endif
}

#ifdef ESP32CAM_FLASH_LED_PIN
static bool s_last_flash_led_state = true;

//=============================================================================================
//=============================================================================================
void enable_esp32cam_flash_led_pin( bool enabled )
{
    gpio_set_level(ESP32CAM_FLASH_LED_PIN, enabled ? 0: 1 );
    s_last_flash_led_state = enabled;
}

//=============================================================================================
//=============================================================================================
void initialize_esp32cam_flash_led_pin( bool enabled )
{
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << ESP32CAM_FLASH_LED_PIN,
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE };
    gpio_config(&io_conf);

    gpio_set_level(ESP32CAM_FLASH_LED_PIN, enabled ? 0: 1 );
    s_last_flash_led_state = enabled;
}

//=============================================================================================
//=============================================================================================
bool read_esp32cam_flash_led_pin()
{
    gpio_set_direction((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_MODE_INPUT );
    gpio_set_pull_mode((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_PULLDOWN_ONLY); 
    gpio_set_level((gpio_num_t)ESP32CAM_FLASH_LED_PIN,0);

    bool state = gpio_get_level((gpio_num_t)ESP32CAM_FLASH_LED_PIN) == 1;

    gpio_set_level((gpio_num_t)ESP32CAM_FLASH_LED_PIN, s_last_flash_led_state ? 0 : 1);
    gpio_set_pull_mode((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_FLOATING); 
    gpio_set_direction((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_MODE_OUTPUT );
    
    return state;
}
#endif

#ifdef REC_BUTTON_PIN
//=============================================================================================
//=============================================================================================
void initialize_rec_button()
{
    printf("Init REC button...\n");

    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << REC_BUTTON_PIN,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE };
    gpio_config(&io_conf);
}

