RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width = 1;
#ifdef SD_CLK_PIN    
    slot_config.clk = SD_CLK_PIN;
    slot_config.cmd = SD_CMD_PIN;
    slot_config.d0 = SD_D0_PIN;
#endif    

    // Enable internal pullups on enabled pins. The internal pullups
    // are insufficient however, please make sure 10k external pullups are
    // connected on the bus. This is for debug / example purpose only.
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;
    
    LOG("Mounting SD card...\n");
    esp_err_t ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config, &mount_config, &card);
    if (ret != ESP_OK)
    {
        LOG("Failed to mount SD card VFAT filesystem. Error: %s\n", esp_err_to_name(ret));
#ifdef BOARD_ESP32CAM
        //to turn the flash LED off
        gpio_set_pull_mode((gpio_num_t)4, GPIO_PULLDOWN_ONLY);
#endif        
        return false;
    }
#endif //SD_CARD_MMC

#ifdef SD_CARD_SPI
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 2,
        .allocation_unit_size = 0,
        .disk_status_check_enable = false, 
        .use_one_fat = false,
        };

    sdmmc_host_t host = SDSPI_HOST_DEFAULT();
    //host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;
    //host.max_freq_khz = SDMMC_FREQ_PROBING;
    //host.max_freq_khz = SDMMC_FREQ_DEFAULT;
    //host.max_freq_khz = 10000;


    spi_bus_config_t bus_cfg = {
        .mosi_io_num = SD_DI_PIN,
        .miso_io_num = SD_DO_PIN,
        .sclk_io_num = SD_CLK_PIN,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .data4_io_num = -1,
        .data5_io_num = -1,
        .data6_io_num = -1,
        .data7_io_num = -1,
        .max_transfer_sz = 4000,
        .flags = 0,
        .intr_flags = 0        
    };

    esp_err_t ret = spi_bus_initialize((spi_host_device_t)host.slot, &bus_cfg, SDSPI_DEFAULT_DMA);
    if (ret != ESP_OK) 
    {
        LOG("Failed to initialize SD SPI bus.");
        return false;
    }
    
    sdspi_device_config_t slot_config = SDSPI_DEVICE_CONFIG_DEFAULT();
    slot_config.gpio_cs = SD_CS_PIN;
    slot_config.host_id = (spi_host_device_t)host.slot;
    //slot_config.wait_for_miso = -1; 

    gpio_set_pull_mode(SD_DO_PIN, GPIO_PULLUP_ONLY);
    gpio_set_pull_mode(SD_DI_PIN, GPIO_PULLUP_ONLY);
    gpio_set_pull_mode(SD_CS_PIN, GPIO_PULLUP_ONLY);
    //slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP; - no .flag

    LOG("Mounting SD card...\n");
    ret = esp_vfs_fat_sdspi_mount("/sdcard", &host, &slot_config, &mount_config, &card);
    if (ret != ESP_OK)
    {
        LOG("Failed to mount SD card VFAT filesystem. Error: %s\n", esp_err_to_name(ret));
        return false;
    }
#endif //SD_CARD_SPI

    LOG("sd card inited!\n");
    s_sd_initialized = true;

    // Card has been initialized, print its properties
    sdmmc_card_print_info(stdout, card);

    updateSDInfo();

    //find the latest file number
    char buffer[64];
    for (uint32_t i = 0; i < 100000; i++)
    {
#ifdef WRITE_RAW_MJPEG_STREAM 
        sprintf(buffer, "/sdcard/v%03lu_000.mpg", (long unsigned int)i);
#else        
        sprintf(buffer, "/sdcard/v%03lu_000.avi", (long unsigned int)i);
#endif        
        FILE* f = fopen(buffer, "rb");
        if (f)
        {
            fclose(f);
            continue;
        }
        s_sd_next_session_id = i;
        s_sd_next_segment_id = 0;
        break;
    }

/*
    // Run file benchmark after SD initialization
    if (s_sd_initialized) 
    {
        run_file_benchmark();
    }
*/

    return true;
}

static int open_sd_file()
{
    char buffer[64];
#ifdef WRITE_RAW_MJPEG_STREAM
    sprintf(buffer, "/sdcard/v%03lu_%03lu.mpg", (long unsigned int)s_sd_next_session_id, (long unsigned int)s_sd_next_segment_id);
#else
    sprintf(buffer, "/sdcard/v%03lu_%03lu.avi", (long unsigned int)s_sd_next_session_id, (long unsigned int)s_sd_next_segment_id);
#endif

    int fd = open(buffer, O_WRONLY | O_CREAT | O_TRUNC, S_IRUSR | S_IWUSR);

    if (fd == -1)
    {
        LOG("error to open sdcard session %s!\n",buffer);
        return-1;
    }

    LOG("Opening session file '%s'\n", buffer);
    s_sd_file_size = 0;
    s_sd_next_segment_id++;

    return fd;
}


#ifdef WRITE_RAW_MJPEG_STREAM
//=============================================================================================
//=============================================================================================
//this will write data from the slow queue to raw MJPEG file
static void sd_write_proc(void*) //s_sd_write_task MJPEG
{
    while (true)
    {
        if (!s_air_record || (s_shouldRestartRecording > esp_timer_get_time()))
        {
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            continue;
        }
        
        s_shouldRestartRecording = 0;

        int fd = open_sd_file();
        if ( fd == -1)
        {
            s_air_record = false;
            SDError = true;
            vTaskDelay(1000 / portTICK_PERIOD_MS); 
            continue;
        }

        xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
        s_sd_slow_buffer->clear();

#ifdef PROFILE_CAMERA_DATA
        s_profiler.set(PF_CAMERA_SD_SLOW_BUF, 0 );
#endif

        xSemaphoreGive(s_sd_slow_buffer_mux);

        bool error = false; 
        bool done = false;
        bool syncFrameStart = true;
        int offset = 0;

        while (!done)
        {
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification

            while (true) //consume all the buffer
            {
                if (!s_air_record)
                {
                    LOG("Done recording, closing file\n", s_sd_file_size);
                    done = true;
                    break;
                }

                if ( s_shouldRestartRecording != 0) 
                {
                    done = true;
                    break;
                }

                int len = SD_WRITE_BLOCK_SIZE - offset;

