RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
            const void* buffer = s_sd_fast_buffer.start_reading(size);
            xSemaphoreGive(s_sd_fast_buffer_mux);

            xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
            if ( !s_sd_slow_buffer->write(buffer, size) )
            {
                s_stats.sd_drops += size;
#ifdef PROFILE_CAMERA_DATA    
                s_profiler.toggle(PF_CAMERA_SD_OVF );
#endif
            }

#ifdef PROFILE_CAMERA_DATA    
            s_profiler.set(PF_CAMERA_SD_SLOW_BUF, s_sd_slow_buffer->size() / (SD_SLOW_BUFFER_SIZE_PSRAM / 100));
#endif
            xSemaphoreGive(s_sd_slow_buffer_mux);

            xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
            s_sd_fast_buffer.end_reading(size);

#ifdef PROFILE_CAMERA_DATA    
            s_profiler.set(PF_CAMERA_SD_FAST_BUF, s_sd_fast_buffer.size() / (SD_FAST_BUFFER_SIZE / 100));
#endif

            xSemaphoreGive(s_sd_fast_buffer_mux);

            if (s_sd_write_task)
                xTaskNotifyGive(s_sd_write_task); //notify task

            if (!s_air_record)
                break;
        }
    }
}

__attribute__((optimize("Os")))
IRAM_ATTR static void add_to_sd_fast_buffer(const void* data, size_t size, bool addFrameStartPattern)
{
    if (xSemaphoreTake(s_sd_fast_buffer_mux, 10 / portTICK_PERIOD_MS) != pdPASS)
    {
        s_stats.sd_drops += size;
#ifdef PROFILE_CAMERA_DATA
        s_profiler.toggle(PF_CAMERA_SD_OVF);
#endif
        return;
    }

    bool ok = s_sd_fast_buffer.write(data, size);

#ifdef WRITE_RAW_MJPEG_STREAM 
#else
    if ( ok && addFrameStartPattern ) 
    {
        ok = s_sd_fast_buffer.writeBytes(0, MJPEG_PATTERN_SIZE);
    }
#endif

#ifdef PROFILE_CAMERA_DATA
    s_profiler.set(PF_CAMERA_SD_FAST_BUF, s_sd_fast_buffer.size() / (SD_FAST_BUFFER_SIZE / 100) );
#endif

    xSemaphoreGive(s_sd_fast_buffer_mux);
    if (ok)
    {
        if (s_sd_enqueue_task)
            xTaskNotifyGive(s_sd_enqueue_task); //notify task
    }
    else
    {
        s_stats.sd_drops += size;
#ifdef PROFILE_CAMERA_DATA
        s_profiler.toggle(PF_CAMERA_SD_OVF);
#endif
    }
}

#endif

//=============================================================================================
//=============================================================================================
// Filters one received transport packet and feeds it into the FEC decoder.
IRAM_ATTR void transport_packet_received_cb(const uint8_t* data, size_t size, int8_t rssi_dbm, int8_t noise_floor_dbm)
{
    auto res = s_fec_decoder.packetFilter.filter_packet(data, size, GROUND2AIR_MAX_MTU);
    if ( res != PacketFilter::PacketFilterResult::Pass)
    {
        s_stats.inRejectedPacketCounter++;
        return;
    }

    s_stats.inPacketCounter++;
    s_stats.rssiDbm = rssi_dbm;
    s_stats.noiseFloorDbm = noise_floor_dbm;

    s_fec_decoder.lock();
    if (!s_fec_decoder.decode_data(data, size, false))
    {
        s_stats.wlan_received_packets_dropped++;
    }
    s_fec_decoder.unlock();

    s_stats.wlan_data_received += size;
}

//=============================================================================================
//=============================================================================================
__attribute__((optimize("Os")))
IRAM_ATTR bool processSetting(const char* valueName, int fromValue, int toValue, const char *nvsName )
{
    if ( fromValue != toValue )
    {
        LOG("%s changed from %d to %d\n", valueName, fromValue, toValue );
        if ( !!nvsName ) 
        {
            nvs_args_set(nvsName, (uint32_t)toValue);
        }
        return true;
    }
    return false;
}

static void unpairGS();

//=============================================================================================
//=============================================================================================
//process settings not related to camera sensor setup
static void handle_ground2air_config_packetEx1(Ground2Air_Config_Packet& src)
{
    s_accept_connection_timeout_ms = 0;

    int64_t t = esp_timer_get_time();
    s_last_seen_config_packet = t;

    Ground2Air_Config_Packet& dst = s_ground2air_config_packet;

    bool transport_changed = processSetting( "apfpv",  dst.misc.apfpv, src.misc.apfpv, "apfpv" );
    if (transport_changed)
    {
        // Transport mode changes are applied after reboot so the full radio stack
        // comes up cleanly in the new mode instead of trying to hot-switch in place.
        if (s_restart_time == 0)
        {
            s_restart_time = esp_timer_get_time() + 1000; //1 ms
        }
    }

    if ( processSetting( "Wifi rate", (int)dst.dataChannel.wifi_rate, (int)src.dataChannel.wifi_rate, "rate") )
    {
        ESP_ERROR_CHECK(set_wifi_fixed_rate(src.dataChannel.wifi_rate));
    }
    
    if ( processSetting( "Wifi power", dst.dataChannel.wifi_power, src.dataChannel.wifi_power, NULL ) )
    {
        ESP_ERROR_CHECK(set_wlan_power_dBm(src.dataChannel.wifi_power));
    }

    if ( processSetting( "FEC codec N", dst.dataChannel.fec_codec_n, src.dataChannel.fec_codec_n, "fec_n") )
    {
        s_fec_encoder.switch_n( src.dataChannel.fec_codec_n );
    }
    
    if ( processSetting( "Wifi channel", dst.dataChannel.wifi_channel, src.dataChannel.wifi_channel, "channel" ) )
    {
        int channel = getValidWifiChannel(src.dataChannel.wifi_channel);
        LOG("Validated Wifi channel: %d\n", channel );

        // APFPV mode must rebuild the AP on the new channel so GS can reassociate to the moved SSID.
        if (src.misc.apfpv != 0)
        {
            LOG("APFPV applying channel change: requested=%d validated=%d rate=%d power=%d\n",
                src.dataChannel.wifi_channel,
                channel,
                (int)src.dataChannel.wifi_rate,
                (int)src.dataChannel.wifi_power);
            ESP_ERROR_CHECK(switch_wifi_transport(true,
                                                 src.dataChannel.wifi_rate,
                                                 channel,
                                                 src.dataChannel.wifi_power));
        }
        else
        {
            ESP_ERROR_CHECK(set_wifi_channel(channel));
        }
    }

