RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    size_t freeSize = 0;
    ESP_ERROR_CHECK( uart_get_tx_buffer_free_size(UART_MAVLINK, &freeSize) );

    if ( freeSize >= s )
    {
        uart_write_bytes(UART_MAVLINK, ((uint8_t*)&src) + sizeof(Ground2Air_Header), s);
    }

    xSemaphoreGive(s_serial_mux);
#endif
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_video_packet(bool last)
{
    s_stats.video_data += s_video_frame_data_size;

    uint32_t size;
    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true, &size);

    if(!packet_data)
    {
        LOG("no data buf!\n");
    }

    Air2Ground_Video_Packet& packet = *(Air2Ground_Video_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Video;
    packet.resolution = s_ground2air_config_packet.camera.resolution;
    packet.frame_index = s_video_frame_index;
    packet.part_index = s_video_part_index;
    packet.last_part = last ? 1 : 0;
    packet.size = s_video_frame_data_size + sizeof(Air2Ground_Video_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;
    packet.crc = 0;
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Video_Packet));
    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
#ifdef PROFILE_CAMERA_DATA    
        s_profiler.toggle(PF_CAMERA_FEC_OVF);
#endif
    }
}

#ifdef UART_MAVLINK
//=============================================================================================
//=============================================================================================
//this currently called every frame: 50...11 fps
//30 fps: 30 * 128 = 3840 bytes/sec or 38400 baud
//11 fps: 11 * 128 - 1408 = 14080 baud
//todo: increase max mavlink payload size to AIR2GROUD_MIN_MTU-sizeof(Ait2Ground_Header). 
//With 128 bytes we can not push 115200 mavlink stream currently.
//also UART RX ring buffer of 512 can not handle 115200 at 11 fps
IRAM_ATTR void send_air2ground_data_packet()
{
    int avail = MAX_TELEMETRY_PAYLOAD_SIZE - s_mavlinkOutBufferCount;
    if ( avail > 0 )
    {
        size_t rs = 0;
        ESP_ERROR_CHECK( uart_get_buffered_data_len(UART_MAVLINK, &rs) );
        if ( rs > avail ) rs = avail;

        if ( rs > 0 )
        {
            int len = uart_read_bytes(UART_MAVLINK, &(s_mavlink_out_buffer[s_mavlinkOutBufferCount]),rs, 0);
            if ( len < 0 )
            {
                LOG("MAVLNK COM error\n");
            }
            else
            {
                s_mavlinkOutBufferCount += len;
            }
        }
    }

    if ( s_mavlinkOutBufferCount < MAX_TELEMETRY_PAYLOAD_SIZE ) return; //todo: or agregationtime

    uint32_t size;
    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true, &size);
    if(!packet_data)
    {
        LOG("no data buf!\n");
        return;
    }

    Air2Ground_Data_Packet& packet = *(Air2Ground_Data_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Telemetry;
    packet.size = s_mavlinkOutBufferCount + sizeof(Air2Ground_Data_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;
    packet.crc = 0;
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Data_Packet));

    memcpy( packet_data + sizeof(Air2Ground_Data_Packet), s_mavlink_out_buffer, s_mavlinkOutBufferCount );

    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
#ifdef PROFILE_CAMERA_DATA
        s_profiler.toggle(PF_CAMERA_FEC_OVF);
#endif
    }
    else
    {
        s_stats.out_telemetry_data += s_mavlinkOutBufferCount;
        s_mavlinkOutBufferCount = 0;
    }
}
#endif

//=============================================================================================
//=============================================================================================
__attribute__((optimize("Os")))
IRAM_ATTR uint16_t encodeOSDData(uint8_t* buffer)
{
	//RLE encoding
    //we hope that OSD content is sparse, and encoded data will fit into MAX_OSD_PAYLOAD_SIZE
	//no more than MAX_OSD_PAYLOAD_SIZE bytes output

	//0 and 255 are special symbols
	//255 [char_low] - font bank switch
	//0 [flags:2,count:6] [char_low] - font bank switch, blink switch and character repeat
    //original 0 is sent as 32
    //original 0xff, 0x100 and 0x1ff are forcibly sent inside command 0

	uint8_t osdPos_y = 0;
	uint8_t osdPos_x = 0;

    int bytesCount = 0;

    bool highBank = false;

    while (bytesCount < (MAX_OSD_PAYLOAD_SIZE - 3 - 2) ) 
    {
        uint16_t lastChar;
        int count = 0;

        while ( true )
        {
            uint16_t c = g_osd.getChar( osdPos_y, osdPos_x );
            if (c == 0) c = 32;

            if (count == 0)
            {
                lastChar = c;
            }
            else if ((lastChar != c) || (count == 127))
            {
                break;
            }

            count++;

            osdPos_x++;
            if (osdPos_x == OSD_COLS)
            {
                osdPos_x = 0;
                osdPos_y++;
                if (osdPos_y == OSD_ROWS)
                {
                    break;
                }
            }
        }

        uint8_t cmd = 0;
        uint8_t lastCharLow = (uint8_t)(lastChar & 0xff);

        bool highBank1 = lastChar > 255;
        if (highBank1 != highBank)
        {
            cmd |= 128;//switch bank attr
            highBank = highBank1;
        }

        if (count == 1 && cmd == 128)
        {
            *buffer++ = 255;  //short command for bank switch with char following
            *buffer++ = lastCharLow;
            bytesCount += 2;
        }
        else if ((count > 2) || (cmd != 0) || (lastCharLow == 0xff) || (lastCharLow == 0))
        {
            cmd |= count;  //long command for bank switch and symbol repeat
            *buffer++ = 0;
            *buffer++ = cmd;
            *buffer++ = lastCharLow;
            bytesCount += 3;
        }
        else if (count == 2)  //cmd == 0 here
        {
            *buffer++ = lastCharLow;
            *buffer++ = lastCharLow;
            bytesCount += 2;
        }
        else  //count = 1
        {
            *buffer++ = lastCharLow;
            bytesCount++;
        }

        if (osdPos_y == OSD_ROWS)
        {
            break;
        }
    }
    *buffer++ = 0;  //command 0 with length=0 -> stop
    *buffer++ = 0;

    return bytesCount + 2;
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_osd_packet()
{
    uint32_t size;
    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true, &size);

    if(!packet_data)
    {
        LOG("no data buf!\n");
        return ;
    }

    Air2Ground_OSD_Packet& packet = *(Air2Ground_OSD_Packet*)packet_data;

    uint16_t osd_enc_size = encodeOSDData(&packet.osd_enc_start);

    packet.type = Air2Ground_Header::Type::OSD;
    packet.size = sizeof(Air2Ground_OSD_Packet) - 1 + osd_enc_size;
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;
    packet.crc = 0;

#ifdef DVR_SUPPORT
    packet.stats.SDDetected = s_sd_initialized ? 1: 0;
    packet.stats.SDSlow = s_last_stats.sd_drops ? 1: 0;
    packet.stats.SDError = SDError ? 1: 0;
#else
    packet.stats.SDDetected = 0;
    packet.stats.SDSlow = 0;
    packet.stats.SDError = 0;
#endif    
    packet.stats.curr_wifi_rate = (uint8_t)s_wlan_rate;

