RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    rateBandwidth = rateBandwidth * 5 / 10;  //assume only  50% of theoretical maximum bandwidth is available in practice

#ifdef BOARD_XIAOS3SENSE        
    //2.9MB/sec is practical maximum limit which works
    if ( rateBandwidth > 2900*1024 ) rateBandwidth = 2900*1024;
#elif defined(BOARD_ESP32C5)
    //limit by 10.0MB/sec otherwise whole system is overloaded
    if ( rateBandwidth > 10000*1024 ) rateBandwidth = 10000*1024;
#else
    //2.3MB/sec is practical maximum limit which works
    if ( rateBandwidth > 2300*1024 ) rateBandwidth = 2300*1024;
#endif

    //decrease available data rate using FEC codec parameters
    int FECbandwidth = rateBandwidth * s_ground2air_config_packet.dataChannel.fec_codec_k / s_ground2air_config_packet.dataChannel.fec_codec_n;

    if ( s_air_record )
    {
#if defined(BOARD_XIAOS3SENSE)
        if ( FECbandwidth > MAX_SD_WRITE_SPEED_ESP32S3 ) FECbandwidth = MAX_SD_WRITE_SPEED_ESP32S3;
#elif defined(BOARD_ESP32C5)
        if ( FECbandwidth > MAX_SD_WRITE_SPEED_ESP32C5 ) FECbandwidth = MAX_SD_WRITE_SPEED_ESP32C5;
#else
        if ( FECbandwidth > MAX_SD_WRITE_SPEED_ESP32 ) FECbandwidth = MAX_SD_WRITE_SPEED_ESP32;
#endif
    }

    if ( isHQDVRMode() )
    {
#ifdef BOARD_XIAOS3SENSE
        FECbandwidth  = MAX_SD_WRITE_SPEED_ESP32S3;
#elif defined(BOARD_ESP32C5)
        FECbandwidth  = MAX_SD_WRITE_SPEED_ESP32C5;
#else
        FECbandwidth  = MAX_SD_WRITE_SPEED_ESP32;
#endif
    }
    
    int frameSize = FECbandwidth / fps;
    if ( frameSize < 1 ) frameSize = 1;

    float k = frameSize * 1.0f / video_full_frame_size;
    if ( k > 1.1f ) k = 1.1f;

    s_quality_framesize_K1 = s_quality_framesize_K1 * k;
    if ( s_quality_framesize_K1 < 0.05f ) s_quality_framesize_K1 = 0.05f;
    if ( s_quality_framesize_K1 > 1.0f ) s_quality_framesize_K1 = 1.0f;


    //k2 - max frame size which do not overload wifi output queue
    //wifi output queue should have space to hold frame data and fec data
    int safe_frame_size = WLAN_OUTGOING_BUFFER_SIZE *  s_ground2air_config_packet.dataChannel.fec_codec_k / s_ground2air_config_packet.dataChannel.fec_codec_n;
    //queue is emptied by tx thread constantly so we can assume virtually "larger buffer"
    safe_frame_size += FECbandwidth / fps; 
    safe_frame_size = safe_frame_size * 7 / 10;  //assume next frame can suddenly increase is size by 30%
    if ( video_full_frame_size > safe_frame_size )
    {
        s_quality_framesize_K2 -= (video_full_frame_size - safe_frame_size) / 100000.0f;// * 30 / fps;
    }
    else
    {
        s_quality_framesize_K2 += ( safe_frame_size - video_full_frame_size ) / 1000000.0f;// * 30 / fps;
    }
    if ( s_quality_framesize_K2 < 0.05f ) s_quality_framesize_K2 = 0.05f;
    if ( s_quality_framesize_K2 > 1.0f ) s_quality_framesize_K2 = 1.0f;


    /*
    s_quality_framesize_K2 = s_quality_framesize_K2 * safe_frame_size * 1.0f / video_full_frame_size;
    if ( s_quality_framesize_K2 < 0.05f ) s_quality_framesize_K2 = 0.05f;
    if ( s_quality_framesize_K2 > 1.0f ) s_quality_framesize_K2 = 1.0f;
    */

    if ( isHQDVRMode() )
    {
        s_quality_framesize_K2 = 1;
    }

    //K3 - wifi queue
    if ( (s_stats.wlan_error_count > 0) || (s_fec_spin_count > 0) || (s_fec_wlan_error_count > 0))
    {
        s_quality_framesize_K3 = 0; //we overloaded wifi buffer. drop quality immediatelly, we do not want to loose more frames
    }

    int min_wlan_outgoing_queue_usage_frame = getMinWlanOutgoingQueueUsageFrame(); //get the minimum wifi queue usage while sending frame

    //keep max wifi out queue usage below 80%
    //keep min wifi out queue usage in range 0...10%
    int max_wlan_outgoing_queue_usage_frame = getMaxWlanOutgoingQueueUsageFrame(); //get the maximum wifi queue usage while sending frame 
    if ( min_wlan_outgoing_queue_usage_frame > 10 )
    {
        s_quality_framesize_K3 -= (min_wlan_outgoing_queue_usage_frame - 10) / 100.0f;
        //make sure quality is dropped at least by 1 point
        while ( s_quality_framesize_K3 > 0 )
        {
            int quality1 = calculateAdaptiveQualityValue();
            if ( quality1 > s_quality ) break;
            s_quality_framesize_K3 -= 0.01;
        }
    }
    else if ( max_wlan_outgoing_queue_usage_frame > 80 )
    {
        s_quality_framesize_K3 -= (max_wlan_outgoing_queue_usage_frame - 60) / 100.0f;
    }
    else 
    {
        s_quality_framesize_K3 += ( 40 - max_wlan_outgoing_queue_usage_frame ) / 10000.0f;
    }
    if ( s_quality_framesize_K3 < 0) s_quality_framesize_K3 = 0;
    else if ( s_quality_framesize_K3 > 1) s_quality_framesize_K3 = 1;

    if ( isHQDVRMode() )
    {
        s_quality_framesize_K3 = 1;
    }
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void applyAdaptiveQuality()
{
    if ( s_ground2air_config_packet.camera.quality != 0 ) return;

    int quality1 = calculateAdaptiveQualityValue();

    if (s_quality != quality1)
    {
        s_quality = quality1;
#ifdef USE_MOCK_CAMERA
        sensor_t* s = mock_camera_sensor_get();
#else
        sensor_t* s = esp_camera_sensor_get();
#endif
        s->set_quality(s, s_quality);

        int sharpness1 = s_ground2air_config_packet.camera.sharpness;

        if ( s_quality > 50 ) sharpness1 = -2; 
        else if ( s_quality > 45 ) sharpness1 = -1;
        else if ( s_quality > 40 ) sharpness1 = 0;

        if ( s_ground2air_config_packet.camera.sharpness < sharpness1 ) sharpness1 = s_ground2air_config_packet.camera.sharpness;

        if (s_sharpness != sharpness1 )
        {
            s->set_sharpness(s, sharpness1);
            s_sharpness = sharpness1;
        }
    }
}

/* 
'bool last' does not mark last JPEG block reliably.

ov2640: if VSYNC interrupt occurs near the end of the last block, we receive another 1Kb block of garbage.
Note that ov2460 sends up zero bytes after FF D9 till 16 byte boundary, then a garbage to the end of the block, 
so if we receive extra block, the end of proper 'last' block is filled by zeros after FF D9

