RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
                    int64_t dt = millis() - s_last_config_packet_tp;
                    if ( dt > 500 ) 
                    {
                        s_last_config_packet_tp = millis();
                        send_air2ground_config_packet();
                    }

                }

                s_video_frame_index++;
            }
        }

//do no clear mock camera data
//do not clear buffer on C5. Frame detection is different onf C5.
#if !defined(USE_MOCK_CAMERA) && !defined(BOARD_ESP32C5)
        //zero start of the DMA block
        for ( int i = 0; i < 16; i++ )
        {
            *clrSrc = 0;
            clrSrc += stride;
        }
#endif
        s_fec_encoder.unlock();
    }

#ifdef PROFILE_CAMERA_DATA    
    s_profiler.set(PF_CAMERA_DATA, 0);
#endif

    return count;
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR static void parlio_data_callback(bool active)
{
#ifdef PROFILE_CAMERA_DATA
    s_profiler.set(PF_PARLIO_DATA, active ? 1 : 0);
#endif
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR static void camera_event_callback(int eventType, int64_t timestamp)
{
#ifdef PROFILE_CAMERA_DATA
    s_profiler.toggle(PF_CAM_EVENT_DMA_EOF + eventType, timestamp);
#endif
}

//=============================================================================================
//=============================================================================================
// Blinks one Morse-code symbol and leaves a one-unit gap before the next symbol.
static void blink_status_led_morse_symbol(uint32_t duration_ms)
{
    static constexpr uint32_t MORSE_UNIT_MS = 150;

    set_status_led(true);
    vTaskDelay(pdMS_TO_TICKS(duration_ms));
    set_status_led(false);
    vTaskDelay(pdMS_TO_TICKS(MORSE_UNIT_MS));
}

//=============================================================================================
//=============================================================================================
// Blinks the SOS distress signal three times to indicate that camera initialization failed.
static void blink_camera_init_failure_sos()
{
    static constexpr uint32_t MORSE_UNIT_MS = 150;
    static constexpr uint32_t MORSE_DOT_MS = MORSE_UNIT_MS;
    static constexpr uint32_t MORSE_DASH_MS = MORSE_UNIT_MS * 3;

    for (int repeat = 0; repeat < 3; ++repeat)
    {
        for (int symbol = 0; symbol < 3; ++symbol)
        {
            blink_status_led_morse_symbol(MORSE_DOT_MS);
        }
        vTaskDelay(pdMS_TO_TICKS(MORSE_UNIT_MS * 2));

        for (int symbol = 0; symbol < 3; ++symbol)
        {
            blink_status_led_morse_symbol(MORSE_DASH_MS);
        }
        vTaskDelay(pdMS_TO_TICKS(MORSE_UNIT_MS * 2));

        for (int symbol = 0; symbol < 3; ++symbol)
        {
            blink_status_led_morse_symbol(MORSE_DOT_MS);
        }

        if (repeat < 2)
        {
            vTaskDelay(pdMS_TO_TICKS(MORSE_UNIT_MS * 6));
        }
    }
}

//=============================================================================================
//=============================================================================================
// Initializes the camera and reboots after signaling SOS if initialization fails.
static void init_camera()
{
    printf("Init camera...\n");

    camera_config_t config = {
        .pin_pwdn = PWDN_GPIO_NUM,
        .pin_reset = RESET_GPIO_NUM,
        .pin_xclk = XCLK_GPIO_NUM,
        .pin_sccb_sda = SIOD_GPIO_NUM,
        .pin_sccb_scl = SIOC_GPIO_NUM,
        .pin_d7 = Y9_GPIO_NUM,
        .pin_d6 = Y8_GPIO_NUM,
        .pin_d5 = Y7_GPIO_NUM,
        .pin_d4 = Y6_GPIO_NUM,
        .pin_d3 = Y5_GPIO_NUM,
        .pin_d2 = Y4_GPIO_NUM,
        .pin_d1 = Y3_GPIO_NUM,
        .pin_d0 = Y2_GPIO_NUM,
        .pin_vsync = VSYNC_GPIO_NUM,
        .pin_href = HREF_GPIO_NUM,
        .pin_pclk = PCLK_GPIO_NUM,
        // Use 12 MHz until SCCB probing identifies the sensor. The camera driver
        // switches to the matching sensor-specific XCLK before capture starts.
        .xclk_freq_hz = 12000000,
        .ov2640_xclk_freq_hz = 12000000,
#if defined(BOARD_ESP32C5)
        .ov5640_xclk_hz = 24000000,
#else
        .ov5640_xclk_hz = 20000000,
#endif
        .ledc_timer = LEDC_TIMER_0,
        .ledc_channel = LEDC_CHANNEL_0,
        .pixel_format = PIXFORMAT_JPEG,
        .frame_size = FRAMESIZE_SVGA,
        .jpeg_quality = 63,  //start from lowest quality to decrease pressure at startup
        .fb_count = 2,
        .fb_location = CAMERA_FB_IN_DRAM,
        .grab_mode = CAMERA_GRAB_LATEST,
        .sccb_i2c_port = I2C_NUM_0,
        .data_available_callback = camera_data_available };

    //camera init
    esp_err_t err = esp_camera_init(&config);
    if (err != ESP_OK)
    {
        //LOG("Camera init failed with error 0x%x", err);
        blink_camera_init_failure_sos();
        vTaskDelay(pdMS_TO_TICKS(1000));
        esp_restart();
    }

    sensor_t* sensor = esp_camera_sensor_get();
    s_camera_sensor_pid = sensor->id.PID;
    LOG("Detected camera sensor PID: 0x%04x\n", s_camera_sensor_pid);

    // Set camera event callback for profiling
    cam_set_camera_event_callback(camera_event_callback);

    // Set parlio data callback for profiling
    cam_set_parlio_data_callback(parlio_data_callback);
}

//#define SHOW_CPU_USAGE

//=============================================================================================
//=============================================================================================
static void print_cpu_usage()
{
#ifdef SHOW_CPU_USAGE
    TaskStatus_t* pxTaskStatusArray;
    volatile UBaseType_t uxArraySize, x;
    uint32_t ulTotalRunTime, ulStatsAsPercentage;

    // Take a snapshot of the number of tasks in case it changes while this
    // function is executing.
    uxArraySize = uxTaskGetNumberOfTasks();
    //LOG("%u tasks\n", uxArraySize);

    // Allocate a TaskStatus_t structure for each task.  An array could be
    // allocated statically at compile time.
    pxTaskStatusArray = (TaskStatus_t*)heap_caps_malloc(uxArraySize * sizeof(TaskStatus_t), MALLOC_CAP_SPIRAM);

    if (pxTaskStatusArray != NULL)
    {
        // Generate raw status information about each task.
        uxArraySize = uxTaskGetSystemState(pxTaskStatusArray, uxArraySize, &ulTotalRunTime);
        //LOG("%u total usage\n", ulTotalRunTime);

        // For percentage calculations.
        ulTotalRunTime /= 100UL;

        // Avoid divide by zero errors.
        if (ulTotalRunTime > 0)
        {
            // For each populated position in the pxTaskStatusArray array,
            // format the raw data as human readable ASCII data
            for (x = 0; x < uxArraySize; x++)
            {
                // What percentage of the total run time has the task used?
                // This will always be rounded down to the nearest integer.
                // ulTotalRunTimeDiv100 has already been divided by 100.
                ulStatsAsPercentage = pxTaskStatusArray[x].ulRunTimeCounter / ulTotalRunTime;

