RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
#ifdef APFPV_FIRMWARE
    s_ground2air_config_packet.misc.apfpv = nvs_args_read( "apfpv", 1 );
#else
    s_ground2air_config_packet.misc.apfpv = nvs_args_read( "apfpv", 0 );
#endif

    s_ground2air_config_packet.misc.osdFontCRC32 = (uint32_t)nvs_args_read( "osdFontCRC32", 0 );

    s_ground2air_config_packet2 = s_ground2air_config_packet;
}

#ifdef USB_DISK_SUPPORT

//=============================================================================================
//=============================================================================================
bool isUSBDiskMounted()
{
    return tud_mounted();
}

//=============================================================================================
//=============================================================================================
void mountUSBDisk()
{
    const esp_vfs_fat_mount_config_t mount_config =
    {
        .format_if_mount_failed = false,
        .max_files = 5,
        .allocation_unit_size = 0,
        .disk_status_check_enable = false,
        .use_one_fat = false
    };

    tinyusb_msc_sdmmc_config_t storage_cfg =
    {
        .card = card,
        .callback_mount_changed = nullptr,
        .callback_premount_changed = nullptr,
        .mount_config = mount_config
    };

    esp_err_t err = tinyusb_msc_storage_init_sdmmc(&storage_cfg);
    if (err != ESP_OK)
    {
        LOG("tinyusb_msc_storage_init_sdmmc failed: %s\n", esp_err_to_name(err));
        return;
    }

    // keep FAT accessible for the file server; ignore "already mounted" state
    err = tinyusb_msc_storage_mount("/sdcard");
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE)
    {
        LOG("tinyusb_msc_storage_mount failed: %s\n", esp_err_to_name(err));
    }

    const tinyusb_config_t tusb_cfg =
    {
        .device_descriptor = nullptr,
        .string_descriptor = nullptr,
        .string_descriptor_count = 0,
        .external_phy = false,
#if (TUD_OPT_HIGH_SPEED)
        .fs_configuration_descriptor = nullptr,
        .hs_configuration_descriptor = nullptr,
        .qualifier_descriptor = nullptr,
#else
        .configuration_descriptor = nullptr,
#endif
        .self_powered = false,
        .vbus_monitor_io = -1
    };

    err = tinyusb_driver_install(&tusb_cfg);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE)
    {
        LOG("tinyusb_driver_install failed: %s\n", esp_err_to_name(err));
        return;
    }

    LOG("USB MSC exposed for SD card\n");
}
#else
//=============================================================================================
//=============================================================================================
bool isUSBDiskMounted()
{
    return false;
}
#endif



//=============================================================================================
//=============================================================================================
extern "C" void app_main()
{
    //esp_task_wdt_init();

#ifdef SUPPRESS_LOGGING
    esp_log_level_set("*", ESP_LOG_NONE);
#endif

#if defined(BOARD_XIAOS3SENSE) || defined(BOARD_ESP32C5)
    vTaskDelay(5000 / portTICK_PERIOD_MS);  //to see init messages
#endif    

    printf("Initializing...\n");

    s_ground2air_data_packet.type = Ground2Air_Header::Type::Telemetry;
    s_ground2air_data_packet.size = sizeof(s_ground2air_data_packet);

    s_ground2air_config_packet.type = Ground2Air_Header::Type::Config;
    s_ground2air_config_packet.size = sizeof(s_ground2air_config_packet);
    s_ground2air_config_packet.dataChannel.wifi_rate = DEFAULT_WIFI_RATE;

    printf("MEMORY at start: \n");
    heap_caps_print_heap_info(MALLOC_CAP_8BIT);
    heap_caps_print_heap_info(MALLOC_CAP_EXEC);
    heap_caps_print_heap_info(MALLOC_CAP_DMA);

    initialize_status_led();
#ifdef ESP32CAM_FLASH_LED_PIN
    initialize_esp32cam_flash_led_pin(true);
#endif    
#ifdef REC_BUTTON_PIN
    initialize_rec_button();
#endif    

#ifdef ENABLE_PROFILER
    s_profiler.init();
#endif

#ifdef DVR_SUPPORT
    //allocate big memory buffer for DVR recorder
    void* psb = heap_caps_malloc(SD_SLOW_BUFFER_SIZE_PSRAM, MALLOC_CAP_SPIRAM);
    if ( !!psb )
    {
        s_sd_slow_buffer = new Circular_Buffer( (uint8_t*)psb, SD_SLOW_BUFFER_SIZE_PSRAM);
    }
    else 
    {
        printf("SD Slow buffer not allocated\n");
        init_failure( );
    }
#endif

#ifdef INIT_UART_0
    printf("Init UART0...\n");
    uart_config_t uart_config0 =
    {
        .baud_rate = UART0_BAUDRATE == MAVLINK_BAUDRATE_SETTING ? (int)s_mavlink_baudrate : UART0_BAUDRATE,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 122,
#ifdef BOARD_ESP32C5
        .source_clk = UART_SCLK_RTC,
#else
        .source_clk = UART_SCLK_APB,
#endif
        .flags = 0
    };
    ESP_ERROR_CHECK(uart_param_config(UART_NUM_0, &uart_config0) );
    ESP_ERROR_CHECK(uart_driver_install(UART_NUM_0, 512, 256, 0, NULL, 0));
    ESP_ERROR_CHECK(uart_set_pin(UART_NUM_0, TXD0_PIN, RXD0_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));
#endif

    //reinitialize rec button after configuring uarts
#ifdef REC_BUTTON_PIN    
    initialize_rec_button();
#endif
    nvs_args_init();

    readConfig();

    s_air_record = s_ground2air_config_packet2.misc.autostartRecord != 0;

    //allocates large continuous Wifi output bufer. Allocate ASAP until memory is not fragmented.
    int channel = getValidWifiChannel( s_ground2air_config_packet.dataChannel.wifi_channel );
    setup_wifi(s_ground2air_config_packet.dataChannel.wifi_rate,
               channel,
               s_ground2air_config_packet.dataChannel.wifi_power,
               s_air_device_id,
               s_ground2air_config_packet.misc.apfpv != 0,
               transport_packet_received_cb);
    s_fec_encoder.packetFilter.set_packet_header_data( s_air_device_id, 0 );

    bool runFileServer = false;

#ifdef DVR_SUPPORT
    runFileServer = getButtonState();
#endif

